from random import choice

ANSWERS = [
    "Бесспорно",
    "Предрешено",
    "Никаких сомнений",
    "Определённо да",
    "Можешь быть уверен в этом",
    "Мне кажется - да",
    "Вероятнее всего",
    "Хорошие перспективы",
    "Знаки говорят - да",
    "Да",
    "Пока неясно, попробуй снова",
    "Спроси позже",
    "Лучше не рассказывать",
    "Сейчас нельзя предсказать",
    "Сконцентрируйся и спроси опять",
    "Даже не думай",
    "Мой ответ - нет",
    "По моим данным - нет",
    "Перспективы не очень хорошие",
    "Весьма сомнительно",
]


def new_game():
    input('Задайте вопрос магическому шару: \n')
    print(f'Шар ответил: \n{choice(ANSWERS)}')


while True:
    new_game()
    again = input('Хочешь задать еще вопрос? (Да/Нет): ')
    if again.strip().lower() == 'нет':
        break
